#ifndef PLATFORMSPECIFIC_PICO2040
#define PLATFORMSPECIFIC_PICO2040
#include "platform.h"
#include "FemtoxTypes.h"

void initWatchDog(void);
void resetWatchDog(void);
/********************************************************************************************************************
*********************************************************************************************************************
                                            ПЛАТФОРМО-ЗАВИСИМЫЕ ФУНКЦИИ														|
*********************************************************************************************************************
*********************************************************************************************************************/

unlock_t lock(const void*const resourceId);

#define WATCH_DOG_ON  initWatchDog()/*Генерируем Reset*/
#define TICK_PER_SECOND (100UL) /*Колличество тиков в секунду*/

void _init_Timer(void);	// Инициализация таймера 0, настройка прерываний каждую 1 мс, установки начальных значений для массива таймеров

void idle(void);

#endif //PLATFORMSPECIFIC_PICO2040