#include "PlatformSpecific.h"
#include "TaskMngr.h"

#ifdef SCELETON

/********************************************************************************************************************
*********************************************************************************************************************
                                            ПЛАТФОРМО-ЗАВИСИМЫЕ ФУНКЦИИ                                                     |
*********************************************************************************************************************
*********************************************************************************************************************/
#ifdef MAXIMIZE_OVERFLOW_ERROR
	void MaximizeErrorHandler(const string_t str){
		initWatchDog();
		while(1);
	}
#else
	void MaximizeErrorHandler(const string_t str){
	}
#endif

static void unlock(const void*const resourceId){} // Освобождение ресурса
unlock_t lock(const void*const resourceId) { // Захват ресурса по его уникальному идентификатору
    return unlock;
}

#ifdef NATIVE_TIMER_PWR_SAVE
u32 _setTickTime(u32 timerTicks){} // В качестве аргумента передается кол-во стандартных тиков таймера
//(Таймер начинает тикать значительно реже что значительно увеличивает энергоэффективность)
// Вернет занчение на которое реально смог изменить частоту прерываний

u32 _getTickTime(){return 0;} // Сколько времени прошло с момента начала отсета до сейчас
// Необходимо для осущществление коррекции в случае если внезапно появился таймер меньше ранее установленного времени

#endif

void initWatchDog(){} // Инициализация сторожевого таймера
void resetWatchDog(void){} // Сборос хардверного ватчдога

void MainTimerISRHandler(void){TimerISR();}
void _init_Timer(){} // Инициализация таймера операционной системы

#ifdef USE_SOFT_UART
/*
****************************************
\\\\   Платформозависимые функции   ////
\\\\         и настройки            ////
****************************************
*/
#include "ProgrammUART.h"
void _initTimerSoftUart(void){} // Инициализация высокоскоростного таймера
void UARTTimerISRHandler(void) {UARTTimerISR();}

#endif

#endif
